import "package:flutter/material.dart";
import "vars.dart";

class SC_tikonHazot extends StatefulWidget {
final bool isDarkMode; // Required boolean input

const SC_tikonHazot({super.key, required this.isDarkMode});

@override
State<SC_tikonHazot> createState() => _SC_tikonHazotState();
}

class _SC_tikonHazotState extends State<SC_tikonHazot> {

  Widget build(BuildContext context) {
    final TextStyle textStyleAppbar = TextStyle(
      fontSize: 30,
      fontFamily: 'DavidLibre',
      fontWeight: FontWeight.w500,
      color: Theme.of(context).colorScheme.secondary,
    );

    final TextStyle textStyleSimpleText = TextStyle(
        fontSize: 22,
        fontFamily: 'DavidLibre',
        fontWeight: FontWeight.w400,
        color: Theme.of(context).colorScheme.secondary,
        height: 1.4);

    final TextStyle textStyleSimpleTextHeadline = TextStyle(
        fontSize: 28,
        fontFamily: 'DavidLibre',
        fontWeight: FontWeight.w500,
        color: Theme.of(context).colorScheme.secondary);

    final TextStyle textStyleSimpleText2 = TextStyle(
        fontSize: 18,
        fontFamily: 'DavidLibre',
        fontWeight: FontWeight.w500,
        color: Theme.of(context).colorScheme.secondary,
        height: 1.3);

    return Scaffold(
      appBar: AppBar(
        backgroundColor: Theme.of(context).colorScheme.background,
        surfaceTintColor: Theme.of(context).colorScheme.background,
        elevation: 4.0,
        shadowColor: Theme.of(context).colorScheme.shadow.withOpacity(0.7),
        title: Align(
          alignment: Alignment.centerRight,
          child: Text("תיקון חצות", style: textStyleAppbar),
        ),
      ),
      body: Scrollbar(
        child: Padding(
          padding: EdgeInsets.only(left: 15.0, right: 15.0, top: 0.0),
          child: SingleChildScrollView(
            child: Column(children: [
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      ' על ידי תיקון חצות נמתק הדין (ספר המידות, המתקת הדין מ"ה).',
                      style: textStyleSimpleText2,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text: '(בימים שאין תחנון אומרים תיקון לאה בלבד)',
                      style: textStyleSimpleText2,
                    ),
                  ],
                ),
              ),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'לְשֵׁם יִחוּד קוּדְשָׁא בְּרִיךְ הוּא וּשְׁכִינְתֵּיהּ, בִּדְחִילוּ וּרְחִימוּ, וּרְחִימוּ וּדְחִילוּ,'
                          ' לְיַחֲדָא שֵׁם אוֹת יוּ"ד וְאוֹת הֵ"י, בְשֵׁם אוֹת וָא"ו וְאוֹת הֵ"י, בְּיִחוּדָא שְׁלִים בְּשֵׁם כָּל יִשְׂרָאֵל,'
                          ' לַאֲקָמָא שְׁכִינְתָּא מֵעַפְרָא וּלְעִילּוּי שְׁכִינַת עֻזֵּנוּ. הֲרֵינִי מוּכָן לוֹמַר (תִּקּוּן רָחֵל)'
                          ' וְתִקּוּן לֵאָה כְּמוֹ שֶׁסִּדְּרוּ לָנוּ רַבּוֹתֵינוּ זִכְרוֹנָם לִבְרָכָה, לְתַקֵּן אֶת שָׁרְשָׁם (שָׁרְשׁוֹ)'
                          ' בְּמָקוֹם עֶלְיוֹן לַעֲשׂוֹת נַחַת רוּחַ לְיוֹצְרֵנוּ וְלַעֲשׂוֹת רְצוֹן בּוֹרְאֵנוּ. וִיהִי נוֹעַם'
                          ' אֲדֹנָי אֱלֹהֵינוּ עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ: וִיהִי'
                          ' נוֹעַם אֲדֹנָי אֱלֹהֵינוּ עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ. וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.longSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text: 'תיקון רחל',
                      style: textStyleSimpleTextHeadline,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'אם אמר תחנון בק"ש תוך חצי שעה לא יאמר כאן אלא יתחיל "מה נאמר" וכו.',
                      style: textStyleSimpleText2,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'אָנָּא יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. תָּבֹא לְפָנֶיךָ תְּפִלָּתֵנוּ. וְאַל תִּתְעַלַּם מַלְכֵּנוּ מִתְּחִנָּתֵנוּ. שֶׁאֵין'
                          ' אֲנַחְנוּ עַזֵּי פָנִים וּקְשֵׁי עֹרֶף לוֹמַר לְפָנֶיךָ, יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ: צַדִּיקִים'
                          ' אֲנַחְנוּ וְלֹא חָטָאנוּ. אֲבָל חָטָאנוּ עָוִינוּ פָּשַׁעְנוּ, אֲנַחְנוּ וַאֲבוֹתֵינוּ וְאַנְשֵׁי בֵיתֵנוּ:'
                          ' אָשַׁמְנוּ. בָּגַדְנוּ. גָּזַלְנוּ. דִּבַּרְנוּ דֹפִי וְלָשׁוֹן הָרָע. הֶעֱוִינוּ. וְהִרְשַׁעְנוּ. זַדְנוּ. חָמַסְנוּ.'
                          ' טָפַלְנוּ שֶׁקֶר וּמִרְמָה. יָעַצְנוּ עֵצוֹת רָעוֹת. כִּזַּבְנוּ. כָּעַסְנוּ. לַצְנוּ. מָרַדְנוּ. מָרִינוּ '
                          'דְבָרֶיךָ. נִאַצְנוּ. נִאַפְנוּ. סָרַרְנוּ. עָוִינוּ. פָּשַׁעְנוּ. פָּגַמְנוּ. צָרַרְנוּ. צִעַרְנוּ אָב וָאֵם.'
                          ' קִשִּׁינוּ עֹרֶף. רָשַׁעְנוּ. שִׁחַתְנוּ. תִּעַבְנוּ. תָּעִינוּ וְתִעֲתַעְנוּ. וְסַרְנוּ מִמִּצְוֹתֶיךָ וּמִמִּשְׁפָּטֶיךָ'
                          ' הַטּובִים וְלֹא שָׁוָה לָנוּ. וְאַתָּה צַדִּיק עַל כָּל הַבָּא עָלֵינוּ. כִּי אֱמֶת עָשִׂיתָ, וַאֲנַחְנוּ הִרְשָׁעְנוּ.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'מַה נֹּאמַר לְפָנֶיךָ יוֹשֵׁב מָרוֹם, וּמַה נְּסַפֵּר לְפָנֶיךָ שׁוֹכֵן שְׁחָקִים. הֲלֹא כָל הַנִּסְתָּרוֹת'
                          ' וְהַנִּגְלוֹת אַתָּה יוֹדֵעַ. אַתָּה יוֹדֵעַ רָזֵי עוֹלָם. וְתַעֲלוּמוֹת סִתְרֵי כָל חָי, אַתָּה חוֹפֵשׂ'
                          ' כָּל חַדְרֵי בָטֶן, רוֹאֶה כְלָיוֹת וָלֵב. אֵין דָּבָר נֶעְלָם מִמֶּךָּ וְאֵין נִסְתָּר מִנֶּגֶד עֵינֶיךָ.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ,'
                          ' שֶׁתִּמְחֹל לָנוּ אֶת כָּל חַטֹּאתֵינוּ, וּתְכַפֵּר לָנוּ אֶת כָּל עֲוֹנוֹתֵינוּ, וְתִמְחֹל וְתִסְלַח לְכָל פְּשָׁעֵינוּ.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text: 'עַל נַהֲרוֹת בָּבֶל שָׁם יָשַׁבְנוּ גַּם'
                          ' בָּכִינוּ. בְּזָכְרֵנוּ אֶת צִיּוֹן: עַל עֲרָבִים בְּתוֹכָהּ. תָּלִינוּ כִּנֹּרוֹתֵינוּ: כִּי שָׁם שְׁאֵלוּנוּ'
                          ' שׁוֹבֵינוּ דִּבְרֵי שִׁיר וְתוֹלָלֵינוּ שִׂמְחָה. שִׁירוּ לָנוּ מִשִּׁיר צִיּוֹן: אֵיךְ נָשִׁיר אֶת שִׁיר'
                          ' יְהֹוָה. עַל אַדְמַת נֵכָר: אִם אֶשְׁכָּחֵךְ יְרוּשָׁלָיִם תִּשְׁכַּח יְמִינִי: תִּדְבַּק לְשׁוֹנִי לְחִכִּי'
                          ' אִם לֹא אֶזְכְּרֵכִי. אִם לֹא אַעֲלֶה אֶת יְרוּשָׁלַיִם. עַל רֹאשׁ שִׂמְחָתִי: זְכֹר יְהֹוָה לִבְנֵי'
                          ' אֱדוֹם אֵת יוֹם יְרוּשָׁלָיִם. הָאֹמְרִים עָרוּ עָרוּ, עַד הַיְסוֹד בָּהּ: בַּת בָּבֶל הַשְּׁדוּדָה.'
                          ' אַשְׁרֵי שֶׁיְּשַׁלֶּם לָךְ, אֶת גְּמוּלֵךְ שֶׁגָּמַלְתְּ לָנוּ: אַשְׁרֵי שֶׁיֹּאחֵז וְנִפֵּץ אֶת עֹלָלַיִךְ אֶל הַסָּלַע:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'מִזְמוֹר לְאָסָף. אֱלֹהִים בָּאוּ גוֹיִם בְּנַחֲלָתֶךָ טִמְּאוּ אֶת הֵיכַל קָדְשֶׁךָ. שָׂמוּ אֶת'
                          ' יְרוּשָׁלַיִם לְעִיִּים: נָתְנוּ אֶת נִבְלַת עֲבָדֶיךָ מַאֲכָל לְעוֹף הַשָּׁמָיִם. בְּשַׂר חֲסִידֶיךָ לְחַיְתוֹ אָרֶץ:'
                          ' שָׁפְכוּ דָמָם כַּמַּיִם סְבִיבוֹת יְרוּשָׁלַיִם וְאֵין קוֹבֵר: הָיִינוּ חֶרְפָּה לִשְׁכֵנֵינוּ. לַעַג וָקֶלֶס '
                          'לִסְבִיבוֹתֵינוּ: עַד מָה יְהֹוָה תֶּאֱנַף לָנֶצַח. תִּבְעַר כְּמוֹ אֵשׁ קִנְאָתֶךָ שְׁפֹךְ חֲמָתְךָ אֶל הַגּוֹיִם'
                          ' אֲשֶׁר לֹא יְדָעוּךָ. וְעַל מַמְלָכוֹת. אֲשֶׁר בְּשִׁמְךָ לא קָרָאוּ: כִּי אָכַל אֶת יַעֲקֹב. וְאֶת נָוֵהוּ '
                          'הֵשַׁמּוּ: אַל תִּזְכָּר לָנוּ עֲוֹנֹת רִאשֹׁנִים. מַהֶר יְקַדְּמוּנוּ רַחֲמֶיךָ. כִּי דַלּונוּ מְאֹד: עָזְרֵנוּ '
                          'אֱלֹהֵי יִשְׁעֵנוּ עַל דְּבַר כְּבוֹד שְׁמֶךָ. וְהַצִּילֵנוּ וְכַפֵּר עַל חַטֹּאתֵינוּ לְמַעַן שְׁמֶךָ: לָמָּה יֹּאמְרוּ'
                          ' הַגּוֹיִם אַיֵּה אֱלֹהֵיהֶם. יִוָּדַע בַּגּוֹיִם לְעֵינֵינוּ, נִקְמַת דַּם עֲבָדֶיךָ הַשָּׁפוּךְ: תָּבוֹא לְפָנֶיךָ '
                          'אֶנְקַת אָסִיר. כְּגֹדֶל זְרוֹעֲךָ. הוֹתֵר בְּנֵי תְמוּתָה: וְהָשֵׁב לִשְׁכֵנֵינוּ שִׁבְעָתַיִם אֶל חֵיקָם. חֶרְפָּתָם'
                          ' אֲשֶׁר חֵרְפוּךָ אֲדנָי: וַאֲנַחְנוּ עַמְּךָ וְצֹאן מַרְעִיתֶךָ נוֹדֶה לְּךָ לְעוֹלָם. לְדוֹר וָדוֹר. נְסַפֵּר תְּהִלָּתֶךָ:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text: 'זְכֹר יְהֹוָה מֶה הָיָה לָנוּ.'
                          ' הַבִּיטָה וּרְאֵה אֶת חֶרְפָּתֵנוּ: נַחֲלָתֵנוּ נֶהֶפְכָה לְזָרִים. בָּתֵּינוּ לְנָכְרִים: יְתוֹמִים הָיִינוּ '
                          'וְאֵין אָב. אִמּוֹתֵינוּ כְּאַלְמָנוֹת: מֵימֵינוּ בְּכֶסֶף שָׁתִינוּ. עֵצֵינוּ בִּמְחִיר יָבֹאוּ: עַל צַוָּארֵנוּ '
                          'נִרְדָּפְנוּ. יָגַעְנוּ וְלֹא הוּנַח לָנוּ: מְִצְרַיִם נָתַנּוּ יָד. אַשׁוּר לִשְׂבֹּעַ לָחֶם: אֲבֹתֵינוּ חָטְאוּ '
                          'וְאֵינָם. וַאֲנַחְנוּ עֲוֹנוֹתֵיהֶם סָבָלְנוּ: עֲבָדִים מָשְׁלוּ בָנוּ. פֹּרֵק אֵין מִיָּדָם: בְּנַפְשֵׁנוּ נָבִיא '
                          'לַחְמֵנוּ. מִפְּנֵי חֶרֶב הַמִּדְבָּר: עוֹרֵנוּ כְּתַנּוּר נִכְמָרוּ. מִפְּנֵי זַלְעֲפוֹת רָעָב: נָשִׁים בְּצִיּוֹן '
                          'עִנּוּ. בְּתֻלּוֹת בְּעָרֵי יְהוּדָה: שָׂרִים בְּיָדָם נִתְלוּ. פְּנֵי זְקֵנִים לֹא נֶהְדָּרוּ: בַּחוּרִים טְחוֹן'
                          ' נָשָׂאוּ. וּנְעָרִים בָּעֵץ כָּשָׁלוּ: זְקֵנִים מִשַּׁעַר שָׁבָתוּ. בַּחוּרִים מִנְּגִינָתָם: שָׁבַת מְשׂוֹשׂ לִבֵּנוּ.'
                          ' נֶהְפַּךְ לְאֵבֶל מְחוֹלֵנוּ: (יכופף ראשו עד "אתה ה" לעולם תשב") נָפְלָה עֲטֶרֶת רֹאשֵׁנוּ.'
                          ' אוֹי נָא לָנוּ כִּי חָטָאנוּ: עַל זֶה הָיָה דָוֶה לִבֵּנוּ. עַל אֵלֶּה חָשְׁכוּ עֵינֵינוּ: עַל הַר'
                          ' צִיּוֹן שֶׁשָּׁמֵם. שׁוּעָלִים הִלְּכוּ בוֹ: אַתָּה יְהֹוָה לְעוֹלָם תֵּשֵׁב. כִּסְאֲךָ לְדוֹר וָדוֹר: לָמָּה לָנֶצַח'
                          ' תִּשְׁכָּחֵנוּ. תַּעַזְבֵנוּ לְאֹרֶךְ יָמִים: הֲשִׁיבֵנוּ יְהֹוָה אֵלֶיךָ וְנָשׁוּבָה. חַדֵּשׁ יָמֵינוּ כְּקֶדֶם: כִּי '
                          'אִם מָאֹס מְאַסְתָּנוּ. קָצַפְתָּ עָלֵינוּ עַד מְאֹד: הֲשִׁיבֵנוּ יְהֹוָה אֵלֶיךָ וְנָשׁוּבָה. חַדֵּשׁ יָמֵינוּ כְּקֶדֶם:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'הַבֵּט מִשָּׁמַיִם וּרְאֵה מִזְּבוּל קָדְשֶׁךָ וְתִפְאַרְתֶּךָ. אַיֵּה קִנְאָתְךָ וּגְבוּרֹתֶיךָ, הֲמוֹן מֵעֶיךָ וְרַחֲמֶיךָ'
                          ' אֵלַי הִתְאַפָּקוּ: כִּי אַתָּה אָבִינוּ, כִּי אַבְרָהָם לֹא יְדָעָנוּ וְיִשְׂרָאֵל לֹא יַכִּירָנוּ. אַתָּה '
                          'יְהֹוָה אָבִינוּ גֹּאֲלֵנוּ מֵעוֹלָם שְׁמֶךָ: לָמָּה תַתְעֵנוּ יְהֹוָה מִדְּרָכֶיךָ, תַּקְשִׁיחַ לִבֵּנוּ מִיִּרְאָתְךָ.'
                          ' שׁוּב לְמַעַן עֲבָדֶיךָ, שִׁבְטֵי נַחֲלָתֶךָ: לַמִּצְעָר יָרְשׁוּ עַם קָדְשֶׁךָ. צָרֵינוּ בּוֹסְסוּ מִקְדָּשֶׁךָ:'
                          ' וְעַתָּה יְהֹוָה אָבִינוּ אָתָּה. אֲנַחְנוּ הַחֹמֶר וְאַתָּה יֹצְרֵנוּ וּמַעֲשֵׂה יָדְךָ כֻּלָּנוּ: אַל תִּקְצֹף'
                          ' יְהֹוָה עַד מְאֹד וְאַל לָעַד תִּזְכֹּר עָוֹן. הֵן הַבֶּט נָא עַמְּךָ כֻלָּנוּ: עָרֵי קָדְשְׁךָ הָיוּ מִדְבָּר.'
                          ' צִיּוֹן מִדְבָּר הָיָתָה יְרוּשָׁלַיִם שְׁמָמָה: בֵּית קָדְשֵׁנוּ וְתִפְאַרְתֵּנוּ אֲשֶׁר הִלְלוּךָ אֲבֹתֵינוּ הָיָה'
                          ' לִשְׂרֵפַת אֵשׁ. וְכָל מַחֲמַדֵּינוּ הָיָה לְחָרְבָּה: הַעַל אֵלֶּה תִתְאַפַּק יְהֹוָה תֶּחֱשֶׁה וּתְעַנֵּנוּ עַד מְאֹד:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'עַל חוֹמֹתַיִךְ יְרוּשָׁלַיִם הִפְקַדְתִּי שׁוֹמְרִים כָּל הַיּוֹם וְכָל '
                          'הַלַּיְלָה תָּמִיד לֹא יֶחֱשׁוּ. הַמַּזְכִּירִים אֶת יְהֹוָה אַל דֳּמִי לָכֶם: וְאַל תִּתְּנוּ דֳמִי לוֹ.'
                          ' עַד יְכוֹנֵן וְעַד יָשִׂים אֶת יְרוּשָׁלַיִם תְּהִלָּה בָּאָרֶץ: נִשְׁבַּע יְהֹוָה בִּימִינוֹ וּבִזְרוֹעַ'
                          ' עֻזּוֹ. אִם אֶתֵּן אֶת דְּגָנֵךְ עוֹד מַאֲכָל לְאֹיְבַיִךְ, וְאִם יִשְׁתּוּ בְנֵי נֵכָר תִּירוֹשֵׁךְ אֲשֶׁר '
                          'יָגַעַתְּ בּו: כִּי מְאַסְפָיו יֹאכְלֻהוּ וְהִלְלוּ אֶת יְהֹוָה. וּמְקַבְּצָיו יִשְׁתֻּהוּ בְּחַצְרוֹת קָדְשִׁי:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'אַתָּה תָקוּם תְּרַחֵם צִיּוֹן. כִּי עֵת לְחֶנְנָהּ כִּי בָא מוֹעֵד: כִּי רָצוּ עֲבָדֶיךָ'
                          ' אֶת אֲבָנֶיהָ. וְאֶת עֲפָרָהּ יְחֹנֵנוּ: בּוֹנֵה יְרוּשָׁלַיִם יְהֹוָה. נִדְחֵי יִשְׂרָאֵל יְכַנֵּס:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text: 'יאמר פה את הקינה "אוי לי על גלות השכינה" וכו.',
                      style: textStyleSimpleText2,
                    ),
                  ],
                ),
              ),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'אוֹי לִי עַל גָּלוּת הַשְּׁכִינָה. אוֹי לִי עַל חֻרְבָּן בֵּית הַמִּקְדָּשׁ. אוֹי לִי עַל שְׂרֵפַת הַתּוֹרָה. אוֹי לִי עַל הֲרִיגַת'
                          ' הַצַּדִּיקִים. אוֹי לִי עַל חִילּוּל שְׁמוֹ הַגָּדוֹל וְתוֹרָתוֹ הַקְּדוֹשָׁה. אוֹי לִי כִּי גָּבַר אוֹיֵב. אוֹי'
                          ' לִי עַל תִּינוֹקוֹת שֶׁל בֵּית רַבָּן שֶׁבָּטְלוּ. אוֹי לִי עַל צַעַר כָּל הָעוֹלָמוֹת. אוֹי לִי עַל צַעַר'
                          ' הָאָבוֹת הַקְּדוֹשִׁים וְהָאִמָּהוֹת הַקְּדוֹשׁוֹת. אוֹי לִי עַל צַעַר הַנְּבִיאִים וְהַחֲסִידִים וְהַצַּדִּיקִים אֲשֶׁר'
                          ' בְּגַן עֵדֶן. אוֹי לִי עַל צַעֲרוֹ שֶׁל מָשִׁיחַ. עֲווֹנוֹתֵינוּ הִטּוּ אֵלֶּה, וּפְשָׁעֵינוּ הֶאֱרִיכוּ קִצֵּנוּ,'
                          ' וְחַטֹּאתֵינוּ מָנְעוּ הַטּוֹב מִמֶּנּוּ. אוֹי לָהֶם לְבָנִים שֶׁגָּלוּ מֵעַל שֻׁלְחָן אֲבִיהֶם זֶה כַּמָּה אֹרֵך '
                          'יָמִים וְשָׁנִים רַבִּים וְרָעִים. כָּל דּוֹר שֶׁלֹּא נִבְנָה בֵּית הַמִּקְדָּשׁ בְּיָמָיו כְּאִילּוּ נֶחְרַב בְּיָמָיו.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.longSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text: 'תיקון לאה',
                      style: textStyleSimpleTextHeadline,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'לְדָוִד מִזְמוֹר ליְהֹוָה הָאָרֶץ וּמְלוֹאָהּ. תֵּבֵל וְישְׁבֵי בָהּ: כִּי הוּא עַל יַמִּים '
                          'יְסָדָהּ. וְעַל נְהָרוֹת יְכוֹנְנֶהָ: מִי יַעֲלֶה בְּהַר יְהֹוָה. וּמִי יָקוּם בִּמְקוֹם קָדְשׁוֹ: נְקִי'
                          ' כַפַּיִם וּבַר לֵבָב אֲשֶׁר לֹא נָשָׂא לַשָּׁוְא נַפְשִׁי. וְלֹא נִשְׁבַּע לְמִרְמָה: יִשָּׂא בְרָכָה מֵאֵת'
                          ' יְהֹוָה. וּצְדָקָה מֵאֱלֹהֵי יִשְׁעוֹ: זֶה דּוֹר דּוֹרְשָׁיו. מְבַקְשֵׁי פָנֶיךָ יַעֲקֹב סֶלָה: שְׂאוּ'
                          ' שְׁעָרִים רָאשֵׁיכֶם וְהִנָּשְׂאוּ פִּתְחֵי עוֹלָם. וְיָבוֹא מֶלֶךְ הַכָּבוֹד: מִי זֶה מֶלֶךְ הַכָּבוֹד '
                          'יְהֹוָה עִזּוּז וְגִבּוֹר. יְהֹוָה גִּבּוֹר מִלְחָמָה: שְׂאוּ שְׁעָרִים רָאשֵׁיכֶם וּשְׂאוּ פִּתְחֵי עוֹלָם.'
                          ' וְיָבֹא מֶלֶךְ הַכָּבוֹד: מִי הוּא זֶה מֶלֶךְ הַכָּבוֹד יְהֹוָה צְבָאוֹת. הוּא מֶלֶךְ הַכָּבוֹד סֶלָה:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'לַמְנַצֵּחַ מַשְׂכִּיל לִבְנֵי קֹרַח: כְּאַיָּל תַּעֲרֹג עַל אֲפִיקֵי מָיִם. כֵּן נַפְשִׁי תַעֲרֹג אֵלֶיךָ'
                          ' אֱלֹהִים: צָמְאָה נַפְשִׁי לֵאלֹהִים לְאֵל חָי מָתַי אָבוֹא. וְאֵרָאֶה פְּנֵי אֱלֹהִים: הָיְתָה לִּי'
                          ' דִמְעָתִי לֶחֶם יוֹמָם וָלָיְלָה. בֶּאֱמֹר אֵלַי כָּל הַיּוֹם אַיֵּה אֱלֹהֶיךָ: אֵלֶּה אֶזְכְּרָה וְאֶשְׁפְּכָה'
                          ' עָלַי נַפְשִׁי כִּי אֶעֱבֹר בַּסָּךְ אֶדַּדֵּם עַד בֵּית אֱלֹהִים בְּקוֹל רִנָּה וְתוֹדָה הָמוֹן חוֹגֵג: מַה'
                          ' תִּשְׁתּוֹחֲחִי נַפְשִׁי וַתֶּהֱמִי עָלָי הוֹחִילִי לֵאלֹהִים כִּי עוֹד אוֹדֶנּוּ יְשׁוּעוֹת פָּנָיו: אֱלֹהַי'
                          ' עָלַי נַפְשִׁי תִשְׁתּוֹחָח עַל כֵּן אֶזְכָּרְךָ מֵאֶרֶץ יַרְדֵּן. וְחֶרְמוֹנִים מֵהַר מִצְעָר: תְּהוֹם אֶל '
                          'תְּהוֹם קוֹרֵא לְקוֹל צִנּוֹרֶיךָ. כָּל מִשְׁבָּרֶיךָ וְגַלֶּיךָ עָלַי עָבָרוּ: יוֹמָם יְצַוֶּה יְהֹוָה חַסְדּוֹ'
                          ' וּבַלַּיְלָה שִׁירֹה עִמִּי. תְּפִלָּה לְאֵל חַיָּי: אוֹמְרָה לְאֵל סַלְעִי לָמָה שְׁכַחְתָּנִי לָמָּה קֹדֵר אֵלֵךְ'
                          ' בְּלַחַץ אוֹיֵב: בְּרֶצַח בְּעַצְמוֹתַי חֵרְפוּנִי צוֹרְרַי. בְּאָמְרָם אֵלַי כָּל הַיּוֹם אַיֵּה אֱלֹהֶיךָ:'
                          ' מַה תִּשְׁתּוֹחֲחִי נַפְשִׁי וּמַה תֶּהֱמִי עָלָי הוֹחִילִי לֵאלֹהִים כִּי עוֹד אוֹדֶנּוּ. יְשׁוּעֹת פָּנַי וֵאלֹהָי:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'שָׁפְטֵנִי אֱלֹהִים וְרִיבָה רִיבִי מִגּוֹי לֹא חָסִיד. מֵאִישׁ מִרְמָה'
                          ' וְעַוְלָה תְפַלְּטֵנִי: כִּי אַתָּה אֱלֹהֵי מָעֻזִּי לָמָה זְנַחְתָּנִי לָמָּה קֹדֵר אֶתְהַלֵּךְ בְּלַחַץ אוֹיֵב:'
                          ' שְׁלַח אוֹרְךָ וַאֲמִתְּךָ הֵמָּה יַנְחוּנִי. יְבִיאוּנִי אֶל הַר קָדְשְׁךָ וְאֶל מִשְׁכְּנוֹתֶיךָ: וְאָבוֹאָה'
                          ' אֶל מִזְבַּח אֱלֹהִים אֶל אֵל שִׂמְחַת גִּילִי וְאוֹדְךָ בְכִנּוֹר אֱלֹהִים אֱלֹהָי: מַה תִּשְׁתּוֹחֲחִי'
                          ' נַפְשִׁי וּמַה תֶּהֱמִי עָלָי. הוֹחִילִי לֵאלֹהִים כִּי עוד אודֶנּוּ. יְשׁוּעות פָּנַי וֵאלהָי:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      '(בימים שאין אומרים בהם תחנון אין אומרים "יענך" וכו)',
                      style: textStyleSimpleText2,
                    ),
                  ],
                ),
              ),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'לַמְנַצֵּחַ מִזְמוֹר לְדָוִד: יַעַנְךָ יְהֹוָה בְּיוֹם צָרָה.'
                          ' יְשַׂגֶּבְךָ שֵׁם אֱלֹהֵי יַעֲקֹב: יִשְׁלַח עֶזְרֶךָ מִקֹּדֶשׁ. וּמִצִּיּוֹן יִסְעָדֶךָּ: יִזְכֹּר כָּל מִנְחֹתֶיךָ. וְעוֹלָתְךָ יְדַשְּׁנֶה סֶלָה: יִתֵּן'
                          ' לְךָ כִלְבָבֶךָ. וְכָל עֲצָתְךָ יְמַלֵּא: נְרַנְּנָה בִּישׁוּעָתֶךָ וּבְשֵׁם אֱלהֵינוּ נִדְגֹּל. יְמַלֵּא יְהֹוָה כָּל מִשְׁאֲלוֹתֶיךָ: עַתָּה יָדַעְתִּי'
                          ' כִּי הוֹשִׁיעַ יְהֹוָה מְשִׁיחוֹ יַעֲנֵהוּ מִשְּׁמֵי קָדְשׁוֹ. בִּגְבוּרוֹת יֵשַׁע יְמִינוֹ: אֵלֶּה בָרֶכֶב וְאֵלֶּה בַסּוּסִים. וַאֲנַחְנוּ בְּשֵׁם'
                          ' יְהֹוָה אֱלֹהֵינוּ נַזְכִּיר: הֵמָה כָּרְעוּ וְנָפָלוּ וַאֲנַחְנוּ קַמְנוּ וַנִּתְעוֹדָד: יְהֹוָה הוֹשִׁיעָה. הַמֶּלֶךְ יַעֲנֵנוּ בְיוֹם קָרְאֵנוּ:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'לַמְנַצֵּחַ בִּנְגִינוֹת מִזְמוֹר שִׁיר: אֱלֹהִים יְחָנֵּנוּ וִיבָרְכֵנוּ.'
                          ' יָאֵר פָּנָיו אִתָּנוּ סֶלָה: לָדַעַת בָּאָרֶץ דַּרְכֶּךָ. בְּכָל גּוֹיִם יְשׁוּעָתֶךָ: יוֹדוּךָ '
                          'עַמִּים אֱלֹהִים. יוֹדוּךָ עַמִּים כֻּלָּם: יִשְׂמְחוּ וִירַנְּנוּ לְאֻמִּים כִּי תִשְׁפֹּט עַמִּים מִישׁוֹר.'
                          ' וּלְאֻמִּים בָּאָרֶץ תַּנְחֵם סֶלָה: יוֹדוּךָ עַמִּים אֱלֹהִים. יוֹדוּךָ עַמִּים כֻּלָּם: אֶרֶץ נָתְנָה'
                          ' יְבוּלָהּ. יְבָרְכֵנוּ אֱלֹהִים אֱלֹהֵינוּ: יְבָרְכֵנוּ אֱלֹהִים. וְיִירְאוּ אוֹתוֹ כָּל אַפְסֵי אָרֶץ:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              Align(
                alignment: Alignment.center,
                child: Padding(
                  padding: const EdgeInsets.all(30.0),
                  child: Image.asset( widget.isDarkMode? "assets/lamnazeh_white.png" : "assets/lamnazeh.png"),
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'הַלְלוּיָהּ אוֹדֶה יְהֹוָה בְּכָל לֵבָב. בְּסוֹד יְשָׁרִים וְעֵדָה: גְּדֹלִים'
                          ' מַעֲשֵׂי יְהֹוָה. דְּרוּשִׁים לְכָל חֶפְצֵיהֶם: הוֹד וְהָדָר פָּעֳלוֹ וְצִדְקָתוֹ עֹמֶדֶת לָעַד: זֵכֶר עָשָׂה'
                          ' לְנִפְלְאֹתָיו. חַנּוּן וְרַחוּם יְהֹוָה: טֶרֶף נָתַן לִירֵאָיו. יִזְכֹּר לְעוֹלָם בְּרִיתוֹ: כֹּחַ מַעֲשָׂיו'
                          ' הִגִּיד לְעַמּוֹ. לָתֵת לָהֶם נַחֲלַת גּוֹיִם: מַעֲשֵׂי יָדָיו אֱמֶת וּמִשְׁפָּט. נֶאֱמָנִים כָֹּל פִּקּוּדָיו:'
                          ' סְמוּכִים לָעַד לְעוֹלָם. עֲשׂוּיִים בֶּאֱמֶת וְיָשָׁר: פְּדוּת שָׁלַח לְעַמּוֹ צִוָּה לְעוֹלָם בְּרִיתוֹ.'
                          ' קָדוֹשׁ וְנוֹרָא שְׁמוֹ: רֵאשִׁית חָכְמָה יִרְאַת יְהֹוָה שֵׂכֶל טוֹב לְכָל עֹשֵׂיהֶם. תְּהִלָּתוֹ עֹמֶדֶת לָעַד:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'נוֹעַ תָּנוּעַ אֶרֶץ כַּשִּׁכּוֹר וְהִתְנוֹדְדָה כַּמְּלוּנָה וְכָבַד עָלֶיהָ פִּשְׁעָהּ וְנָפְלָה וְלֹא תֹסִיף קוּם. וְהָיָה'
                          ' בַּיּוֹם הַהוּא יִפְקֹד יְהוָה עַל צְבָא הַמָּרוֹם בַּמָּרוֹם וְעַל מַלְכֵי הָאֲדָמָה עַל הָאֲדָמָה:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'לַמְנַצֵּחַ מִזְמוֹר לְדָוִד: בְּבוֹא אֵלָיו נָתָן הַנָּבִיא. כַּאֲשֶׁר'
                          ' בָּא אֶל בַּת שָׁבַע: חָנֵּנִי אֱלֹהִים כְּחַסְדֶּךָ. כְּרֹב רַחֲמֶיךָ מְחֵה פְשָׁעָי: הֶרֶב כַּבְּסֵנִי'
                          ' מֵעֲוֹנִי. וּמֵחַטָּאתִי טַהֲרֵנִי: כִּי פְשָׁעַי אֲנִי אֵדָע. וְחַטָּאתִי נֶגְדִּי תָמִיד: לְךָ'
                          ' לְבַדְּךָ חָטָאתִי וְהָרַע בְּעֵינֶיךָ עָשִׂיתִי לְמַעַן תִּצְדַּק בְּדָבְרֶךָ תִּזְכֶּה בְשָׁפְטֶךָ: הֵן בְּעָוֹן'
                          ' חוֹלָלְתִּי. וּבְחֵטְא יֶחֱמַתְנִי אִמִּי: הֵן אֱמֶת חָפַצְתָּ בַטֻּחוֹת וּבְסָתֻם חָכְמָה תוֹדִיעֵנִי:'
                          ' תְּחַטְּאֵנִי בְאֵזוֹב וְאֶטְהָר. תְּכַבְּסֵנִי וּמִשֶּׁלֶג אַלְבִּין: תַּשְׁמִיעֵנִי שָׂשׂון וְשִׂמְחָה. תָּגֵלְנָה'
                          ' עֲצָמוֹת דִּכִּיתָ: הַסְתֵּר פָּנֶיךָ מֵחֲטָאָי. וְכָל עֲוֹנתַי מְחֵה: לֵב טָהוֹר בְּרָא לִי אֱלהִים.'
                          ' וְרוּחַ נָכוֹן חַדֵּשׁ בְּקִרְבִּי: אַל תַּשְׁלִיכֵנִי מִלְּפָנֶיךָ. וְרוּחַ קָדְשְׁךָ אַל תִּקַּח מִמֶּנִּי:'
                          ' הָשִׁיבָה לִּי שְׂשׂוֹן יִשְׁעֶךָ. וְרוּחַ נְדִיבָה תִסְמְכֵנִי: אֲלַמְּדָה פֹשְׁעִים דְּרָכֶיךָ. וְחַטָּאִים'
                          ' אֵלֶיךָ יָשׁוּבוּ: הַצִּילֵנִי מִדָּמִים אֱלֹהִים אֱלֹהֵי תְשׁוּעָתִי. תְּרַנֵּן לְשׁוֹנִי צִדְקָתֶךָ: אֲדֹנָי'
                          ' שְׂפָתַי תִּפְתַּח. וּפִי יַגִּיד תְּהִלָּתֶךָ: כִּי לֹא תַחְפֹּץ זֶבַח וְאֶתֵּנָה. עוֹלָה לֹא תִרְצֶה: זִבְחֵי'
                          ' אֱלֹהִים רוּחַ נִשְׁבָּרָה לֵב נִשְׁבָּר וְנִדְכֶּה. אֱלֹהִים לֹא תִבְזֶה: הֵיטִיבָה בִרְצוֹנְךָ אֶת צִיּוֹן.'
                          ' תִּבְנֶה חוֹמוֹת יְרוּשָׁלָיִם: אָז תַּחְפֹּץ זִבְחֵי צֶדֶק עוֹלָה וְכָלִיל. אָז יַעֲלוּ עַל מִזְבַּחֲךָ פָרִים:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'בימים שאין אומרים תקון רחל ידלג על הפסוק "עד אנה" ויתחיל "תקום תרחם" וכו.',
                      style: textStyleSimpleText2,
                    ),
                  ],
                ),
              ),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'עַד אָנָה בִּכְיָה בְצִיּוֹן וּמִסְפֵּד בִּירוּשָׁלָיִם.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'תָּקוּם תְּרַחֵם צִיּוֹן תִּבְנֶה חוֹמוֹת יְרוּשָׁלָיִם:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ, מֶלֶךְ רַחֲמָן רַחֵם עָלֵינוּ. טוֹב וּמֵטִיב הִדָּרֵשׁ לָנוּ. שׁוּבָה עָלֵינוּ בַּהֲמוֹן'
                          ' רַחֲמֶיךָ בִּגְלַל אָבוֹת שֶׁעָשׂוּ רְצונֶךָ. בְּנֵה בֵיתְךָ כְּבַתְּחִלָּה. כּונֵן בֵּית מִקְדָּשְׁךָ עַל מְכוֹנוֹ,'
                          ' הַרְאֵנוּ בְּבִנְיָנוֹ, שַׂמְּחֵנוּ בְּתִקּוּנוֹ. וְהָשֵׁב שְׁכִינָתְךָ לְתוֹכוֹ. וְהָשֵׁב כֹּהֲנִים לַעֲבוֹדָתָם. וּלְוִים '
                          'לְדוּכָנָם, לְשִׁירָם וּלְזִמְרָם. וְהָשֵׁב יִשְׂרָאֵל לִנְוֵיהֶם. וְשָׁם נַעֲלֶה וְנֵרָאֶה וְנִשְׁתַּחֲוֶה לְפָנֶיךָ.'
                          ' יְהִי רָצוֹן מִלְּפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ וֵאלֹהֵי אֲבוֹתֵינוּ. שֶׁתַּעֲלֵנוּ בְשִׂמְחָה לְאַרְצֵנוּ. וְתִטָּעֵנוּ'
                          ' בִּגְבוּלֵנוּ. וְשָׁם נַעֲשֶׂה לְפָנֶיךָ אֶת קָרְבְּנוֹת חוֹבוֹתֵינוּ. תְּמִידִים כְּסִדְרָם וּמוּסָפִים כְּהִלְכָתָם.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'שִׁיר הַמַּעֲלוֹת בְּשׁוּב יְהֹוָה אֶת שִׁיבַת צִיּוֹן. הָיִינוּ כְּחֹלְמִים: אָז יִמָּלֵא'
                          ' שְׂחוֹק פִּינוּ וּלְשׁוֹנֵנוּ רִנָּה אָז יֹאמְרוּ בַגּוֹיִים. הִגְדִּיל יְהֹוָה לַעֲשׂוֹת עִם אֵלֶּה: הִגְדִּיל'
                          ' יְהֹוָה לַעֲשׂות עִמָּנוּ. הָיִינוּ שְׂמֵחִים: שׁוּבָה יְהֹוָה אֶת שְׁבִיתֵנוּ. כַּאֲפִיקִים בַּנֶּגֶב: הַזֹּרְעִים'
                          ' בְּדִמְעָה בְּרִנָּה יִקְצֹרוּ: הָלֹךְ יֵלֵךְ וּבָכֹה נֹשֵׂא מֶשֶׁךְ הַזָּרַע בֹּא יָבֹא בְרִנָּה. נֹשֵׂא אֲלֻמּוֹתָיו:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.longSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text: 'לאחר שהשלים תיקון חצות יאמר:',
                      style: textStyleSimpleText2,
                    ),
                  ],
                ),
              ),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'אֲנִי מַאֲמִין בֶּאֱמוּנָה שְׁלֵמָה בְּנֶחָמַת צִיּוֹן, אֱלֹהֵינוּ בְּרַחֲמָיו יְנַחֲמֶנּוּ וִיחַדֵּשׁ עָלֵינוּ מַלְכוּתוֹ מְהֵרָה.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'עָלֵינוּ לְשַׁבֵּחַ לַאֲדוֹן הַכֹּל, לָתֵת גְּדֻלָּה לְיוֹצֵר בְּרֵאשִׁית, שֶׁלֹּא עָשָׂנוּ כְּגוֹיֵי הָאֲרָצוֹת, וְלֹא שָׂמָנוּ'
                          ' כְּמִשְׁפְּחוֹת הָאֲדָמָה. שֶׁלֹּא שָׂם חֶלְקֵנוּ כָּהֶם, וְלֹא גוֹרָלֵנוּ כְּכָל-הֲמוֹנָם, שֶׁהֵם מִשְׁתַּחֲוִים לְהֶבֶל וָרִיק,'
                          ' וּמִתְפַּלְּלִים אֶל אֵל לֹא יוֹשִׁיעַ. (יפסיק מעט) וַאֲנַחְנוּ מִשְׁתַּחֲוִים לִפְנֵי מֶלֶךְ מַלְכֵי הַמְּלָכִים'
                          ' הַקָּדוֹשׁ בָּרוּךְ הוּא, שֶׁהוּא נוֹטֶה שָׁמַיִם וְיֹסֵד אָרֶץ, וּמוֹשַׁב יְקָרוֹ בַּשָּׁמַיִם מִמַּעַל, וּשְׁכִינַת עֻזּוֹ'
                          ' בְּגָבְהֵי מְרוֹמִים. הוּא אֱלֹהֵינוּ וְאֵין עוֹד אַחֵר, אֱמֶת מַלְכֵּנוּ וְאֶפֶס זוּלָתוֹ. כַּכָּתוּב בַּתּוֹרָה:'
                          ' וְיָדַעְתָּ הַיּוֹם וַהֲשֵׁבֹתָ אֶל לְבָבֶךָ כִּי יְהֹוָה הוּא הָאֱלֹהִים בַּשָּׁמַיִם מִמַּעַל וְעַל הָאָרֶץ מִתָּחַת אֵין עוֹד.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'עַל כֵּן נְקַוֶּה-לָּךְ יְהֹוָה אֱלֹהֵינוּ, לִרְאוֹת מְהֵרָה בְּתִפְאֶרֶת עֻזָּךְ, לְהַעֲבִיר גִּלּוּלִים'
                          ' מִן הָאָרֶץ, וְהָאֱלִילִים כָּרוֹת יִכָּרֵתוּן, לְתַקֵּן עוֹלָם בְּמַלְכוּת שַׁדַּי, וְכָל בְּנֵי בָשָׂר '
                          'יִקְרְאוּ בִשְׁמֶךָ, לְהַפְנוֹת אֵלֶיךָ כָּל רִשְׁעֵי אָרֶץ. יַכִּירוּ וְיֵדְעוּ כָּל יוֹשְׁבֵי תֵבֵל, כִּי-לְךָ'
                          ' תִּכְרַע כָּל-בֶּרֶךְ, תִּשָּׁבַע כָּל לָשׁוֹן. לְפָנֶיךָ יְהֹוָה אֱלֹהֵינוּ יִכְרְעוּ וְיִפֹּלוּ, וְלִכְבוֹד שִׁמְךָ'
                          ' יְקָר יִתֵּנוּ, וִיקַבְּלוּ כֻלָּם אֶת עֹל מַלְכוּתֶךָ, וְתִמְלֹךְ עֲלֵיהֶם מְהֵרָה לְעוֹלָם וָעֶד. כִּי'
                          ' הַמַּלְכוּת שֶׁלְּךָ הִיא, וּלְעוֹלְמֵי עַד תִּמְלֹךְ בְּכָבוֹד. כַּכָּתוּב בְּתוֹרָתָךְ: יְהֹוָה יִמְלֹךְ לְעֹלָם '
                          'וָעֶד. וְנֶאֱמַר: וְהָיָה יְהֹוָה לְמֶלֶךְ עַל כָּל הָאָרֶץ בַּיּוֹם הַהוּא יִהְיֶה יְהֹוָה אֶחָד וּשְׁמוֹ'
                          ' אֶחָד: וּבְתוֹרָתְךָ יְהֹוָה אֱלֹהֵינוּ כָּתוּב לֵאמוֹר שְׁמַע יִשְׂרָאֵל יְהֹוָה אֱלֹהֵינוּ יְהֹוָה אֶחָד.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.longSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text: 'פתח אליהו',
                      style: textStyleSimpleTextHeadline,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text: '(ב פעמים)',
                      style: textStyleSimpleText2,
                    ),
                  ],
                ),
              ),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'וִיהִי נֹעַם אֲדֹנָי אֱלֹהֵינוּ עָלֵינוּ, וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנָה עָלֵינוּ וּמַעֲשֵׂה יָדֵינוּ כּוֹנְנֵהוּ:',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'פָּתַח אֵלִיָּהוּ הַנָּבִיא זָכוּר לְטוֹב וְאָמַר, רִבּוֹן עָלְמִין דְּאַנְתְּ הוּא חָד וְלָא בְחֻשְׁבָּן, אַנְתְּ הוּא עִלָּאָה עַל כָּל עִלָּאִין,'
                          ' סְתִימָא עַל כָּל סְתִימִין, לֵית מַחֲשָׁבָה תְּפִיסָא בָךְ כְּלָל, אַנְתְּ הוּא דְאַפַּקְתְ עֲשַׂר תִּקּוּנִין,'
                          ' וְקָרִינָן לוֹן עֲשַׂר סְפִירָן, לְאַנְהָגָא בְהוֹן עָלְמִין סְתִימִין דְּלָא אִתְגַּלְיָין וְעָלְמִין דְּאִתְגַּלְיָין,'
                          ' וּבְהוֹן אִתְכְּסִיאַת מִבְּנֵי נָשָׁא, וְאַנְתְּ הוּא דְקָשִׁיר לוֹן, וּמְיַחֵד לוֹן, וּבְגִין דְּאַנְתְּ מִלְּגָאו,'
                          ' כָּל מָאן דְּאַפְרֵישׁ חַד מִן חַבְרֵיהּ מֵאִלֵּין עֲשַׂר, אִתְחֲשִׁב לֵהּ כְּאִלּוּ אַפְרִישׁ בָּךְ. וְאִלֵּין עֲשַׂר סְפִירָן'
                          ' אִינּוּן אָזְלִין כְּסִדְרָן, חַד אֲרִיךְ, וְחַד קָצֵר, וְחַד בֵּינוֹנִי, וְאַנְתְּ הוּא דְאַנְהִיג לוֹן, וְלֵית '
                          'מָאן דְּאַנְהִיג לָךְ, לָא לְעֵלָא וְלָא לְתַתָּא וְלָא מִכָּל סִטְרָא, לְבוּשִׁין תַּקִַנְתְּ לוֹן, דְּמִנַּיְיהוּ פָּרְחִין'
                          ' נִשְׁמְתִין לִבְנֵי נְשָׁא, וְכַמָּה גוּפִין תַּקַנְת לוֹן, דְּאִתְקְרִיאוּ גוּפָא לְגַבֵּי לְבוּשִׁין דִּמְכַסִין עֲלֵיהוֹן,'
                          ' וְאִתְקְרִיאוּ בְּתִקּוּנָא דָא, חֶסֶד דְּרוֹעָא יְמִינָא, גְּבוּרָה דְרוֹעָא שְׂמָאלָא, תִּפְאֶרֶת גּוּפָא, נֶצַח וְהוֹד'
                          ' תְּרֵין שׁוֹקִין, יְסוֹד סִיּוּמָא דְגוּפָא אוֹת בְּרִית קֹדֶשׁ, מַלְכוּת פֶּה תּוֹרָה שֶׁבְּעַל פֶּה קָרִינָן לָהּ.'
                          ' חָכְמָה מוֹחָא אִיהִי מַחֲשָׁבָה מִלְּגָאו, בִּינָה לִבָּא וּבָהּ הַלֵּב מֵבִין. וְעַל אִלֵּין תְּרֵין כְּתִיב:'
                          ' "הַנִּסְתָּרוֹת לַיְהֹוָה אֱלֹהֵינוּ, כֶּתֶר עֶלְיוֹן אִיהוּ כֶתֶר מַלְכוּת, וַעֲלֵהּ אִתְּמַר: "מַגִּיד מֵרֵאשִׁית אַחֲרִית",'
                          ' וְאִיהוּ קַרְקַפְתָּא דִתְּפִלֵּי. מִלְּגָאו אִיהוּ אוֹת יוּ"ד אוֹת הֵ"א אוֹת וָא"ו אוֹת הֵ"א, דְּאִיהוּ אֹרַח'
                          ' אֲצִילוּת, אִיהוּ שַׁקְיוּ דְאִילָנָא בִּדְרוֹעוֹי וְעַנְפּוֹי, כְּמַיָּא דְאַשְׁקֵי לְאִילָנָא, וְאִתְרַבֵּי בְּהַהוּא שַׁקְיוּ.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'רִבּוֹן עָלְמִין! אַנְתְּ הוּא עִלַּת הָעִלּוֹת, וסִבַּת הַסִּבּוֹת, דְּאַשְׁקֵי לְאִילָנָא בְּהַהוּא נְבִיעוּ,'
                          ' וְהַהוּא נְבִיעוּ אִיהוּ כְּנִשְׁמָתָא לְגוּפָא, דְאִיהי חַיִּים לְגוּפָא, וּבָךְ לֵית דִּמְיוֹן וְלֵית דִּיוֹקְנָא'
                          ' (דְגוּפָא) מִכָּל מַה דִּלְּגָאו וּלְבָר, וּבָרָאתָ שְׁמַיָּא וְאַרְעָא, וְאַפַּקְתְּ מִנְּהוֹן שִׁמְשָׁא וְסִיהֲרָא '
                          'וְכֹכְבַיָּא וּמַזָּלֵי, וּבְאַרְעָא אִלָנִין וּדְשָׁאִין וְגִנְּתָא דְעֵדֶן וְעִשְׂבִּין וְחֵיוָן וְעוֹפִין וְנוּנִין'
                          ' וּבְעִירִין וּבְנֵי נְשָׁא, לְאִשְׁתְּמוֹדְעָא בְהוֹן עִלָּאִין, וְאֵיךְ יִתְנַהֲגוּן בְּהוֹן עִלָּאִין וְתַתָּאִין,'
                          ' וְאֵיךְ אִשְׁתְּמוֹדְעָן מֵעִלָּאֵי וְתַתָּאֵי, וְלֵית דְּיָדַע בָּךְ כְּלָל. וּבַר מִנָּךְ לֵית יִחוּדָא בְּעִלָּאֵי וְתַתָּאֵי,'
                          ' וְאַנְתְּ אִשְׁתְּמוֹדָע אָדוֹן עַל כֹּלָּא, וְכָל סְפִירָן כָּל חַד אִית לֵהּ שֵׁם יְדִיעַ, וּבְהוֹן אִתְקְרִיאוּ'
                          ' מַלְאָכַיָּא, וְאַנְתְּ לֵית לָךְ שֵׁם יְדִיעַ, דְּאַנְתְּ הוּא מְמַלֵּא כָל שְׁמָהָן, וְאַנְתְּ הוּא שְׁלִימוּ דְּכֻלְּהוּ. '
                          'וְכַד אַנְתְּ תִּסְתַּלַּק מִנְּהוֹן, אִשְׁתְּאָרוּ כֻּלְּהוּ שְׁמָהָן כְּגוּפָא בְּלָא נִשְׁמְתָא. אַנְתְּ חַכִּים וְלָאו בְּחָכְמָה '
                          'יְדִיעָא, אַנְתְּ הוּא מֵבִין וְלָאו מִבִּינָה יְדִיעָא, לֵית לָךְ אֲתַר יְדִיעָא אֶלָּא לְאִשְׁתְּמוֹדְעָא תָּקְפָךְ'
                          ' וְחֵילָךְ לִבְנֵי נְשָׁא, וּלְאַחְזָאָה לוֹן אֵיךְ אִתְנְהִיג עָלְמָא בְּדִינָא וּבְרַחֲמֵי, דְאִינוּן צֶדֶק וּמִשְׁפָּט,'
                          ' כְּפוּם עוֹבָדֵיהוֹן דִּבְנֵי נְשָׁא, דִּין אִיהוּ גְבוּרָה, מִשְׁפָּט עַמּוּדָא דְאֶמְצָעִיתָא, צֶדֶק מַלְכוּתָא'
                          ' קַדִּישָׁא, מֹאזְנֵי צֶדֶק תְּרֵין סַמְכֵי קְשׁוֹט, הִין צֶדֶק אוֹת בְּרִית, כֹּלָּא לְאַחְזָאָה אֵיךְ אִתְנְהִיג'
                          ' עָלְמָא, אֲבָל לָאו דְּאִית לָךְ צֶדֶק יְדִיעָא דְאִיהוּ דִין, וְלָאו מִשְׁפָּט יְדִיעָא דְאִיהוּ רַחֲמֵי,'
                          ' וְלָאו מִכָּל אִלֵּין מִדּוֹת כְּלָל. קוּם רִבִּי שִׁמְעוֹן וְיִתְחַדְשׁוּן מִלִּין עַל יְדָךְ, דְּהָא רְשׁוּתָא אִית'
                          ' לָךְ לְגַלָּאָה רָזִין טְמִירִין עַל יְדָךְ, מַה דְּלָא אִתְיְהִיב רְשׁוּ לְגַלָּאָה לְשׁוּם בַּר נַשׁ עַד כְּעַן.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'קָם רִבִּי שִׁמְעוֹן פָּתַח וְאָמַר: לְךָ יְהֹוָה הַגְּדוּלָה וְהַגְּבוּרָה וְהַתִּפְאֶרֶת וְהַנֵּצַח וְהַהוֹד כִּי כָל'
                          ' בַּשָּׁמַיִם וּבָאָרֶץ. לְךָ יְהֹוָה הַמַּמְלָכָה וְהַמִּתְנַשֵּׂא לְכָל לְרֹאשׁ. עִלָּאִין שְׁמָעוּ אִינוּן דְּמִיכִין דְּחֶבְרוֹן,'
                          ' וְרַעְיָא מְהֵימְנָא אִתְעָרוּ מִשְּׁנַתְכוֹן, הָקִיצוּ וְרַנְּנוּ שׁוֹכְנֵי עָפָר, אִלֵּין אִינוּן צַדִּיקַיָּא דְאִינוּן'
                          ' מִסִּטְרָא דְהַהִיא דְאִתְּמַר בָּהּ: אֲנִי יְשֵׁנָה וְלִבִּי עֵר, וְלָאו אִינוּן מֵתִים, וּבְגִין דָּא אִתְּמַר בְּהוֹן'
                          ' הָקִיצוּ וְרַנְּנוּ וגו", רַעְיָא מְהֵימְנָא אַנְתְּ וַאֲבָהָן הָקִיצוּ וְרַנְּנוּ לְאִתְעָרוּתָא דִשְׁכִינְתָּא דְאִיהִי'
                          ' יְשֵׁנָה בְּגָלוּתָא. דְּעַד כְּעַן צַדִּיקַיָּא כֻּלְּהוּ דְּמִיכִין וְשִׁנְתָא בְחוֹרֵיהוֹן. מִיָּד יְהִיבַת שְׁכִינְתָּא תְּלַת'
                          ' קָלִין לְגַבֵּי רַעְיָא מְהֵימְנָא, וְיֵימָא לֵיהּ קוּם רַעְיָא מְהֵימְנָא, דְהָא עֲלָךְ אִתְּמַר קוֹל דּוֹדִי דוֹפֵק'
                          ' לְגַבָּאי בְּאַרְבַּע אַתְוָן דִּילֵיהּ, וְיֵימָא בְהוֹן, פִּתְחִי לִי אֲחוֹתִי רַעְיָתִי יוֹנָתִי תַמָּתִי, דְּהָא תַּם'
                          ' עֲוֹנֵךְ בַּת צִיּוֹן, לֹא יוֹסִיף לְהַגְלוֹתֵךְ. שֶׁרֹאשִׁי נִמְלָא טָל, מַאי נִמְלָא טָל? אֶלָּא אָמַר קוּדְשָׁא '
                          'בְּרִיךְ הוּא: אַנְתְּ חָשַׁבְת דְמִיּוֹמָא דְאִתְחָרַב בֵּי מַקְדְּשָׁא דְעָאלְנָא בְּבֵיתָא דִילִי, וְעָאלְנָא בְיִשּׁוּבָא?'
                          ' לָאו הָכִי, דְלָא עָאלְנָא כָּל זִמְנָא דְאַנְתְּ בְּגָלוּתָא, הֲרֵי לָךְ סִימָנָא שֶׁרֹאשִׁי נִמְלָא טָל, אוֹת הֵ"א'
                          ' שְׁכִינְתָּא בְגָלוּתָא, שְׁלִימוּ דִּילָהּ וְחַיִּים דִּילָהּ אִיהוּ טָל, וְדָא אִיהוּ אוֹת יוּ"ד אוֹת הֵ"א אוֹת'
                          ' וָא"ו, אֲבָל אוֹת הֵ"א אִיהִי שְׁכִינְתָּא דְלָא מֵחוּשְׁבַּן טָ"ל, אֶלָּא אוֹת יוּ"ד אוֹת הֵ"א אוֹת וָא"ו,'
                          ' דִּסְלִיקוּ אַתְוָן לְחֻשְׁבַּן טָ"ל, דְּאִיהוּ מַלְיָא לִשְׁכִינְתָּא מִנְּבִיעוּ דְּכָל מְקוֹרִין עִלָּאִין, מִיָּד קָם'
                          ' רַעְיָא מְהֵימְנָא, וַאֲבָהָן קַדִּישִׁין עִמֵּיהּ, עַד כַּאן רָזָא דְיִחוּדָא. בָּרוּךְ יְהֹוָה לְעוֹלָם אָמֵן וְאָמֵן.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'וִיהֵא רַעֲוָא מִן קֳדָם עַתִּיקָא קַדִּישָׁא דְּכָל קַדִּישִׁין, טְמִירָא דְכָל טְמִירִין,'
                          ' סְתִימָא דְכֹלָּא, דְּיִתְמְשַׁךְ טַלָּא עִלָּאָה מִנֵּהּ לְמַלְיָא רֵישֵׁיהּ דִזְעֵיר אַנְפִּין וּלְהַטִּיל לַחֲקַל תַּפּוּחִין'
                          ' קַדִּישִׁין בִּנְהִירוּ דְאַנְפִּין בְּרַעֲוָא וּבְחֶדְוָתָא דְכֹלָּא. וְיִתְמְשַׁךְ מִן קֳדָם עַתִּיקָא קַדִּישָׁא דְכָל'
                          ' קַדִּישִׁין, טְמִירָא דְכָל טְמִירִין, סְתִימָא דְכֹלָּא, רְעוּתָא וְרַחֲמֵי, חִנָּא וְחִסְדָּא, בִּנְהִירוּ עִלָּאָה'
                          ' בִּרְעוּתָא וְחֶדְוָה, עָלַי וְעַל כָּל בְּנֵי בֵיתִי, וְעַל כָּל הַתְּלוּיִם בִּי, וְעַל כָּל הַנִּלְוִים אֵלַי,'
                          ' וְעַל כָּל יִשְׂרָאֵל עַמֵּיהּ, וְיִפְרְקִינָן מִכָּל עַקְתִּין בִּישִׁין דְּיֵיתוּן לְעָלְמָא, וְיַזְמִין וְיִתְיְהִיב'
                          ' לָנָא מְזוֹנָא וּפַרְנָסָתָא טַבְתָּא, בְּלִי צָרָה וְעַקְתָּא, מִמַּזָּלָא דְכָל מְזוֹנֵי בֵּה תַּלְין. וִישֵׁזְבִינָן'
                          ' מֵעֵינָא בִישָׁא וּמֵחַרְבָּא דְמַלְאַךְ הַמָּות וּמִדִּינָהּ שֶׁל גֵּהִנָּם. וְיַיְתֵי לָנָא וּלְכָל נַפְשָׁתָנָא חִנָּא'
                          ' וְחִסְדָּא, וְחַיֵּי אֲרִיכֵי וּמְזוֹנֵי רְוִיחֵי, וְרַחֲמֵי מִן קֳדָמֵיהּ. אָמֵן כֵּן יְהִי רָצוֹן אָמֵן וְאָמֵן.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.longSpace),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'טוב לאמר אחרי תיקון חצות לשון הזוהר בפרשת נח דף ס"ה ע"א.',
                      style: textStyleSimpleText2,
                    ),
                  ],
                ),
              ),
              CustomRichText(
                textSpan: TextSpan(
                  children: <TextSpan>[
                    TextSpan(
                      text:
                      'אָמַר רִבִּי שִׁמְעוֹן, אֲרֵימִת יְדָאי בִּצְלוֹתִין לְעֵלָא, דְּכַד רְעוּתָא'
                          ' עִלָּאָה לְעֵלָא לְעֵלָא, קָיְימָא עַל הַהוּא רְעוּתָא דְּלָא אִתְיְדָע וְלָא אִתְפַּס כְּלַל לְעָלְמִין רֵישָׁא דְּסָתִים'
                          ' יַתִּיר לְעֵלָא. וְהַהוּא רֵישָׁא אַפֵּק מַאי דְאַפֵּק וְלָא יְדִיעַ וְנָהִיר מַאי דְנָהִיר כֹּלָּא בִּסְתִימוּ. רְעוּ '
                          'דְּמַחֲשָׁבָה עִלָּאָה לְמִרְדַּף אֲבַתְרֵיהּ וּלְאִתְנַהֲרָא מִנֵּיהּ. חַד פְּרִיסוּ אִתְפְּרִיס. וּמִגּוֹ הַהוּא פְּרִיסָא בִּרְדִיפוּ'
                          ' דְּהַהִיא מַחֲשָׁבָה עִלָּאָה מָטֵי וְלָא מָטֵי עַד הַהוּא פְּרִיסָא נָהִיר מַאי דְּנָהִיר. וּכְדֵין אִיהוּ מַחֲשָׁבָה'
                          ' עִלָּאָה נָהִיר בִּנְהִירוּ סְתִים דְּלָא יְדִיעַ וְהַהוּא מַחֲשָׁבָה לָא יָדַע. כְּדֵין בָּטַשׁ הַאי נְהִירוּ דְּמַחֲשָׁבָה'
                          ' דְּלָא אִתְיְידַע בִּנְהִירוּ דְּפַרְסָא דְּקָיְימָא דְּנָהִיר מִמַּה דְּלָא יְדִיעַ וְלָא אִתְיְידַע וְלָא אִתְגַּלְיָיא. '
                          'וּכְדֵין דָּא נְהִירוּ דְּמַחֲשָׁבָה דְּלָא אִתְיְידַע בָּטַשׁ בִּנְהִירוּ דִּפְרִיסָא וְנָהֲרִין כְּחֲדָא וְאִתְעֲבִידוּ תִּשְׁעָה'
                          ' הֵיכָלִין. וְהֵיכָלִין לָאו אִנּוּן נְהוֹרִין וְלָאו אִנּוּן רוּחִין וְלָאו אִנּוּן נִשְׁמְתִין. וְלָא אִית'
                          ' מָאן דְּקָיְימָא בְּהוּ. רְעוּתָא דְּכָל תִּשְׁעָה נְהוֹרִין דְּקָיְימֵי כֻּלְהוּ בְּמַחֲשָׁבָה דְּאִיהוּ חַד מִנַּיְיהוּ '
                          'בְּחוּשְׁבָּנָא כֻּלְהוּ לְמִרְדַּף בַּתְרַיְיהוּ בְּשַׁעֲתָא דְּקָיְימֵי בְּמַחֲשָׁבָה וְלָא מִתְדַּבְּקִין וְלָא אִתְיְדָעוּ. וְאִלֵּין'
                          ' לָא קָיְימֵי לָא בִּרְעוּתָא וְלָא בְּמַחֲשָׁבָה עִלָּאָה תָּפְסִין בָּהּ וְלָא תָפְסִין. בְּאִלֵּין קָיְימֵי כָּל רָזֵי'
                          ' דִמְהֵימְנוּתָא וְכָל אִנּוּן נְהוֹרִין מֵרָזָא דְּמַחֲשָׁבָה עִלָּאָה וּלְתַתָּא כֻּלְהוּ אִקְרוּן אֵין סוֹף. עַד הָכָא'
                          ' מָטוּ נְהוֹרִין וְלָא מָטוּן וְלָא אִתְיְידָעוּ. לָאו הָכָא רְעוּתָא וְלָא מַחֲשָׁבָה. כַּד נָהִיר מַחֲשָׁבָה'
                          ' וְלָא אִתְיְידַע מִמַּאן דְּנָהִיר. כְּדֵין אִתְלַבַּשׁ וְאִסְתִּים גּוֹ בִּינָה וְנָהִיר לְמַאן דְנָהִיר וְאָעֵל'
                          ' דָּא בְּדָא עַד דְּאִתְכְּלִילוּ כֻּלְהוּ כְּחֲדָא. וּבְרָזָא דְּקָרְבָּנָא כַּד סָלִיק כֹּלָּא אִתְקַשַּׁר דָּא בְּדָא וְנָהִיר'
                          ' דָּא בְּדָא. כְּדֵין קָיְימֵי כֻּלְהוּ בִּסְלִיקוּ וּמַחֲשָׁבָה אִתְעַטַּר בְּאֵין סוֹף. הַהוּא נְהִירוּ דְּאִתְנְהִיר'
                          ' מִנֵּיהּ מַחֲשָׁבָה עִלָּאָה דְּלָא אִתְיְדַע בָּהּ כְּלָל אִקְרֵי אֵין סוֹף. וּמִנֵּיהּ אִשְׁתְּכַח וְקָיְימָא וְנָהִיר'
                          ' לְמַאן דְּנָהִיר וְעַל דָּא כֹּלָּא קָאִים. זַכָּאָה חוּלָקֵיהוֹן דְּצַדִּיקַיָא בְּעָלְמָא דֵין וּבְעָלְמָא דְּאָתֵי.',
                      style: textStyleSimpleText,
                    ),
                  ],
                ),
              ),
              SizedBox(height: vars.shortSpace),
            ]),
          ),
        ),
      ),
    );
  }
}
